<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"4fb3321c085126c7dac5994c9d1a403fb08cdcf48ec12c4d3a30c869155cf202","plan_job_ref":"Job build-infra #7 at https://github.com/davefurmidge/ECommerceApi/actions/runs/7688622864","plan_hash":"76748c2e198fc6693a2f03b18aca082eb8babfcb2aa6e270c468dd0112849afa","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan in __infra/terraform__
With backend config: `key=terraform.tfstate,resource_group_name=furmidge-rg
storage_account_name=st32322133171896025803
container_name=tfstate`
With var files: `infra/terraform/infra.tfvars`
<details>
<summary>Plan: 13 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurecaf_name.resource_group will be created
+   resource "azurecaf_name" "resource_group" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "ecommerce-api-furmidge"
+       passthrough   = false
+       random_length = 0
+       resource_type = "azurerm_resource_group"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       suffixes      = [
+           "dev",
        ]
+       use_slug      = true
    }

  # azurerm_resource_group.main will be created
+   resource "azurerm_resource_group" "main" {
+       id       = (known after apply)
+       location = "ukwest"
+       name     = (known after apply)
+       tags     = {
+           "application-name"          = "ecommerce-api-furmidge"
+           "environment"               = "dev"
+           "terraform"                 = "true"
+           "terraform_storage_account" = "st32322133171896025803"
        }
    }

  # module.application.azurecaf_name.app_service will be created
+   resource "azurecaf_name" "app_service" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "ecommerce-api-furmidge"
+       passthrough   = false
+       random_length = 0
+       resource_type = "azurerm_app_service"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       suffixes      = [
+           "dev",
        ]
+       use_slug      = true
    }

  # module.application.azurecaf_name.app_service_plan will be created
+   resource "azurecaf_name" "app_service_plan" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "ecommerce-api-furmidge"
+       passthrough   = false
+       random_length = 0
+       resource_type = "azurerm_app_service_plan"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       suffixes      = [
+           "dev",
        ]
+       use_slug      = true
    }

  # module.application.azurerm_linux_web_app.application will be created
+   resource "azurerm_linux_web_app" "application" {
+       app_settings                      = (known after apply)
+       client_affinity_enabled           = false
+       client_certificate_enabled        = false
+       client_certificate_mode           = "Required"
+       custom_domain_verification_id     = (sensitive value)
+       default_hostname                  = (known after apply)
+       enabled                           = true
+       hosting_environment_id            = (known after apply)
+       https_only                        = true
+       id                                = (known after apply)
+       key_vault_reference_identity_id   = (known after apply)
+       kind                              = (known after apply)
+       location                          = "ukwest"
+       name                              = (known after apply)
+       outbound_ip_address_list          = (known after apply)
+       outbound_ip_addresses             = (known after apply)
+       possible_outbound_ip_address_list = (known after apply)
+       possible_outbound_ip_addresses    = (known after apply)
+       public_network_access_enabled     = true
+       resource_group_name               = (known after apply)
+       service_plan_id                   = (known after apply)
+       site_credential                   = (sensitive value)
+       tags                              = {
+           "application-name" = "ecommerce-api-furmidge"
+           "environment"      = "dev"
        }
+       zip_deploy_file                   = (known after apply)

+       site_config {
+           always_on                               = false
+           container_registry_use_managed_identity = false
+           default_documents                       = (known after apply)
+           detailed_error_logging_enabled          = (known after apply)
+           ftps_state                              = "FtpsOnly"
+           health_check_eviction_time_in_min       = (known after apply)
+           http2_enabled                           = false
+           linux_fx_version                        = (known after apply)
+           load_balancing_mode                     = "LeastRequests"
+           local_mysql_enabled                     = false
+           managed_pipeline_mode                   = "Integrated"
+           minimum_tls_version                     = "1.2"
+           remote_debugging_enabled                = false
+           remote_debugging_version                = (known after apply)
+           scm_minimum_tls_version                 = "1.2"
+           scm_type                                = (known after apply)
+           scm_use_main_ip_restriction             = false
+           use_32_bit_worker                       = true
+           vnet_route_all_enabled                  = false
+           websockets_enabled                      = false
+           worker_count                            = (known after apply)

+           application_stack {
+               docker_registry_password = (sensitive value)
+               docker_registry_url      = (known after apply)
+               docker_registry_username = (known after apply)
+               dotnet_version           = "7.0"
            }
        }
    }

  # module.application.azurerm_service_plan.application will be created
+   resource "azurerm_service_plan" "application" {
+       id                           = (known after apply)
+       kind                         = (known after apply)
+       location                     = "ukwest"
+       maximum_elastic_worker_count = (known after apply)
+       name                         = (known after apply)
+       os_type                      = "Linux"
+       per_site_scaling_enabled     = false
+       reserved                     = (known after apply)
+       resource_group_name          = (known after apply)
+       sku_name                     = "F1"
+       tags                         = {
+           "application-name" = "ecommerce-api-furmidge"
+           "environment"      = "dev"
        }
+       worker_count                 = (known after apply)
    }

  # module.database.azurecaf_name.mssql_database will be created
+   resource "azurecaf_name" "mssql_database" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "ecommerce-api-furmidge"
+       passthrough   = false
+       random_length = 0
+       resource_type = "azurerm_mssql_database"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       suffixes      = [
+           "dev",
        ]
+       use_slug      = true
    }

  # module.database.azurecaf_name.mssql_firewall_rule will be created
+   resource "azurecaf_name" "mssql_firewall_rule" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "ecommerce-api-furmidge"
+       passthrough   = false
+       random_length = 0
+       resource_type = "azurerm_sql_firewall_rule"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       suffixes      = [
+           "dev",
        ]
+       use_slug      = true
    }

  # module.database.azurecaf_name.mssql_server will be created
+   resource "azurecaf_name" "mssql_server" {
+       clean_input   = true
+       id            = (known after apply)
+       name          = "ecommerce-api-furmidge"
+       passthrough   = false
+       random_length = 0
+       resource_type = "azurerm_mssql_server"
+       result        = (known after apply)
+       results       = (known after apply)
+       separator     = "-"
+       suffixes      = [
+           "dev",
        ]
+       use_slug      = true
    }

  # module.database.azurerm_mssql_database.database will be created
+   resource "azurerm_mssql_database" "database" {
+       auto_pause_delay_in_minutes         = 60
+       collation                           = "SQL_Latin1_General_CP1_CI_AS"
+       create_mode                         = "Default"
+       creation_source_database_id         = (known after apply)
+       geo_backup_enabled                  = true
+       id                                  = (known after apply)
+       ledger_enabled                      = (known after apply)
+       license_type                        = (known after apply)
+       maintenance_configuration_name      = (known after apply)
+       max_size_gb                         = (known after apply)
+       min_capacity                        = 0.5
+       name                                = (known after apply)
+       read_replica_count                  = (known after apply)
+       read_scale                          = (known after apply)
+       restore_point_in_time               = (known after apply)
+       sample_name                         = (known after apply)
+       server_id                           = (known after apply)
+       sku_name                            = "GP_S_Gen5_1"
+       storage_account_type                = "Geo"
+       transparent_data_encryption_enabled = true
+       zone_redundant                      = (known after apply)
    }

  # module.database.azurerm_mssql_firewall_rule.database will be created
+   resource "azurerm_mssql_firewall_rule" "database" {
+       end_ip_address   = "0.0.0.0"
+       id               = (known after apply)
+       name             = (known after apply)
+       server_id        = (known after apply)
+       start_ip_address = "0.0.0.0"
    }

  # module.database.azurerm_mssql_server.database will be created
+   resource "azurerm_mssql_server" "database" {
+       administrator_login                  = "sqladmin"
+       administrator_login_password         = (sensitive value)
+       connection_policy                    = "Default"
+       fully_qualified_domain_name          = (known after apply)
+       id                                   = (known after apply)
+       location                             = "ukwest"
+       minimum_tls_version                  = "1.2"
+       name                                 = (known after apply)
+       outbound_network_restriction_enabled = false
+       primary_user_assigned_identity_id    = (known after apply)
+       public_network_access_enabled        = true
+       resource_group_name                  = (known after apply)
+       restorable_dropped_database_ids      = (known after apply)
+       tags                                 = {
+           "application-name" = "ecommerce-api-furmidge"
+           "environment"      = "dev"
        }
+       version                              = "12.0"
    }

  # module.database.random_password.password will be created
+   resource "random_password" "password" {
+       bcrypt_hash      = (sensitive value)
+       id               = (known after apply)
+       length           = 32
+       lower            = true
+       min_lower        = 0
+       min_numeric      = 0
+       min_special      = 0
+       min_upper        = 0
+       number           = true
+       numeric          = true
+       override_special = "_%@"
+       result           = (sensitive value)
+       special          = true
+       upper            = true
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   application_name = (known after apply)
+   application_url  = (known after apply)
+   resource_group   = (known after apply)
```
</details>

:memo: Plan generated in [build-infra #7](https://github.com/davefurmidge/ECommerceApi/actions/runs/7688622864)